app/controllers/songs_controller.rb

SELECT "artists".* FROM "artists"
---
  def new # SongsController GET new sets artist when nested route
    if params[:artist_id] && !Artist.exists?(params[:artist_id])

INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This is a test song!"], ["artist_id", 1], ["created_at", "2016-02-01 09:00:33.478413"], ["updated_at", "2016-02-01 09:00:33.478413"]]
---
  def create # SongsController POST create accepts and sets artist_id
    @song = Song.new(song_params)
    if @song.save

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]
---
  def edit # SongsController GET edit validates artist when nested
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      if @artist.nil?
        redirect_to artists_path, alert: "Artist not found."
      else
        @song = @artist.songs.find_by(id: params[:id])